{"data":[{"id":2,"title":"Ring Driving School","image":"","html":"<div>In August 2009, after having noticed that the driving school industry was lacking a high standard of professionalism, quality vehicles and integrity, we started Ring Driving School to bring these aspects to driver training in Zimbabwe.</div><div><br></div><div>Our <b>88% pass rate</b> for the student drivers who train with us testifies of our professionalism and experience and is undisputed evidence that we are very good at what we do.</div><div><br></div><div>We take pride in the fact that we have brand new cars in our pool and maintain a modern fleet as can be seen below.</div><div><br></div><div>Our Nissan UD70 Trucks were bought brand new from Dulys, the oldest being five years old and the other (8) other UD70 trucks are averagely three years old.</div><div><br></div><div><div>Our (3) Chery cars are less than two years old, bought brand new from Quest Motors, (2) Chevrolets less than a year old, bought brand new from GM Chevrolet and the Nissan March cars averagely three years old.</div><div><br></div><div>We have the following classes and vehicles to serve you.</div><div><ul><li>One Class (4) vehicle in Bulawayo, two in Chitungwiza, and nine in Harare.</li><li>One Class (1) vehicle (Bus) covering Bulawayo every 1st week of every month, Chitungwiza every Thursday and Harare the 2nd, 3rd and 4th week of every month.</li><li>Two Class (3) vehicles (Motor Bikes) currently covering Harare only with the plan to expand as the need arises.</li><li>One Class (2) vehicle (UD70 Truck) in Bulawayo, two in Chitungwiza and four in Harare.</li><li>One Horse &amp;amp; Tanker Class (1) which run for 2 weeks. After two weeks of training you get certificate of training valid within the SADC region in collaboration with the Traffic Safety Council of Zimbabwe.</li></ul>We also conduct Oral Lessons / Classes for those that wish to go a sit for their provisional driver's license test.</div></div>","rating":5,"city":"Harare","latitude":"-17.836388","longitude":"31.041066","cost":8,"phone":"+263778029823","whatsapp":"+263778029823","messenger":"ringdrivingschool","createdAt":"1610107372783","updatedAt":"8"}]}